torvalds/linux/drivers/staging/rtl8723au/core/rtw_cmd.c
/*
Caller and the rtw_cmd_thread23a can protect cmd_q by spin_lock.
No irqsave is necessary.
*/

int rtw_init_cmd_priv23a(struct cmd_priv *pcmdpriv)
{
	int res = _SUCCESS;

	pcmdpriv->cmd_issued_cnt = 0;
	pcmdpriv->cmd_done_cnt = 0;
	pcmdpriv->rsp_cnt = 0;

	pcmdpriv->wq = alloc_workqueue("rtl8723au_cmd", 0, 1);
	if (!pcmdpriv->wq)
		res = _FAIL;

	return res;
}

/* forward definition */

static void rtw_irq_work(struct work_struct *work);

u32 rtw_init_evt_priv23a(struct evt_priv *pevtpriv)
{
	pevtpriv->wq = alloc_workqueue("rtl8723au_evt", 0, 1);

	INIT_WORK(&pevtpriv->irq_wk, rtw_irq_work);

	return _SUCCESS;
}

void rtw_free_evt_priv23a(struct evt_priv *pevtpriv)
{
	cancel_work_sync(&pevtpriv->irq_wk);
}

static int rtw_cmd_filter(struct cmd_priv *pcmdpriv, struct cmd_obj *cmd_obj)
{
	/* set to true to allow enqueuing cmd when hw_init_completed is false */
	u8 bAllow = false;

	if (cmd_obj->cmdcode == GEN_CMD_CODE(_SetChannelPlan))
		bAllow = true;

	if (pcmdpriv->padapter->hw_init_completed == false && bAllow == false)
		return _FAIL;
	return _SUCCESS;
}

static void rtw_cmd_work(struct work_struct *work);

int rtw_enqueue_cmd23a(struct cmd_priv *pcmdpriv, struct cmd_obj *cmd_obj)
{
	int res = _FAIL;

	if (!cmd_obj)
		goto exit;

	cmd_obj->padapter = pcmdpriv->padapter;

	res = rtw_cmd_filter(pcmdpriv, cmd_obj);
	if (res == _FAIL) {
		rtw_free_cmd_obj23a(cmd_obj);
		goto exit;
	}

	INIT_WORK(&cmd_obj->work, rtw_cmd_work);

	res = queue_work(pcmdpriv->wq, &cmd_obj->work);

	if (!res) {
		netdev_err(pcmdpriv->padapter->pnetdev,
			   "%s: Call to queue_work() failed\n", __func__);
		res = _FAIL;
	} else
		res = _SUCCESS;
exit:

	return res;
}

void rtw_free_cmd_obj23a(struct cmd_obj *pcmd)
{

	if (pcmd->cmdcode != _JoinBss_CMD_ &&
	    pcmd->cmdcode != _CreateBss_CMD_) {
		/* free parmbuf in cmd_obj */
		kfree(pcmd->parmbuf);
	}

	if (pcmd->rsp) {
		if (pcmd->rspsz != 0) {
			/* free rsp in cmd_obj */
			kfree(pcmd->rsp);
		}
	}

	kfree(pcmd);
}

static void rtw_cmd_work(struct work_struct *work)
{
	int (*cmd_hdl)(struct rtw_adapter *padapter, const u8 *pbuf);
	void (*pcmd_callback)(struct rtw_adapter *dev, struct cmd_obj *pcmd);
	struct cmd_priv *pcmdpriv;
	struct cmd_obj *pcmd = container_of(work, struct cmd_obj, work);

	pcmdpriv = &pcmd->padapter->cmdpriv;

	if (rtw_cmd_filter(pcmdpriv, pcmd) == _FAIL) {
		pcmd->res = H2C_DROPPED;
		goto post_process;
	}

	pcmdpriv->cmd_issued_cnt++;

	pcmd->cmdsz = ALIGN(pcmd->cmdsz, 4);

	if (pcmd->cmdcode < (sizeof(wlancmds)/sizeof(struct cmd_hdl))) {
		cmd_hdl = wlancmds[pcmd->cmdcode].h2cfuns;

		if (cmd_hdl)
			pcmd->res = cmd_hdl(pcmd->padapter, pcmd->parmbuf);
		else
			pcmd->res = H2C_DROPPED;
	} else
		pcmd->res = H2C_PARAMETERS_ERROR;

post_process:
	/* call callback function for post-processed */
	if (pcmd->cmdcode < (sizeof(rtw_cmd_callback) /
			     sizeof(struct _cmd_callback))) {
		pcmd_callback =	rtw_cmd_callback[pcmd->cmdcode].callback;
		if (!pcmd_callback) {
			RT_TRACE(_module_rtl871x_cmd_c_, _drv_info_,
				 "mlme_cmd_hdl(): pcmd_callback = 0x%p, cmdcode = 0x%x\n",
				 pcmd_callback, pcmd->cmdcode);
			rtw_free_cmd_obj23a(pcmd);
		} else {
			/* need consider that free cmd_obj in
			   rtw_cmd_callback */
			pcmd_callback(pcmd->padapter, pcmd);
		}
	} else {
		RT_TRACE(_module_rtl871x_cmd_c_, _drv_err_,
			 "%s: cmdcode = 0x%x callback not defined!\n",
			 __func__, pcmd->cmdcode);
		rtw_free_cmd_obj23a(pcmd);
	}
}


int rtw_sitesurvey_cmd23a(struct rtw_adapter *padapter,
			  struct cfg80211_ssid *ssid, int ssid_num,
			  struct rtw_ieee80211_channel *ch, int ch_num)
{
	int res = _FAIL;
	struct cmd_obj *ph2c;
	struct sitesurvey_parm *psurveyPara;
	struct cmd_priv *pcmdpriv = &padapter->cmdpriv;
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;

	if (check_fwstate(pmlmepriv, _FW_LINKED))
		rtw_lps_ctrl_wk_cmd23a(padapter, LPS_CTRL_SCAN, 1);

	ph2c = kzalloc(sizeof(struct cmd_obj), GFP_ATOMIC);
	if (!ph2c)
		return _FAIL;

	psurveyPara = kzalloc(sizeof(struct sitesurvey_parm), GFP_ATOMIC);
	if (!psurveyPara) {
		kfree(ph2c);
		return _FAIL;
	}

	rtw_free_network_queue23a(padapter);

	RT_TRACE(_module_rtl871x_cmd_c_, _drv_info_,
		 "%s: flush network queue\n", __func__);

	init_h2fwcmd_w_parm_no_rsp(ph2c, psurveyPara,
				   GEN_CMD_CODE(_SiteSurvey));

	/* psurveyPara->bsslimit = 48; */
	psurveyPara->scan_mode = pmlmepriv->scan_mode;

	/* prepare ssid list */
	if (ssid) {
		int i;

		for (i = 0; i < ssid_num && i < RTW_SSID_SCAN_AMOUNT; i++) {
			if (ssid[i].ssid_len) {
				memcpy(&psurveyPara->ssid[i], &ssid[i],
				       sizeof(struct cfg80211_ssid));
				psurveyPara->ssid_num++;
			}
		}
	}

	/* prepare channel list */
	if (ch) {
		int i;

		for (i = 0; i < ch_num && i < RTW_CHANNEL_SCAN_AMOUNT; i++) {
			if (ch[i].hw_value &&
			    !(ch[i].flags & IEEE80211_CHAN_DISABLED)) {
				memcpy(&psurveyPara->ch[i], &ch[i],
				       sizeof(struct rtw_ieee80211_channel));
				psurveyPara->ch_num++;
			}
		}
	}

	set_fwstate(pmlmepriv, _FW_UNDER_SURVEY);

	res = rtw_enqueue_cmd23a(pcmdpriv, ph2c);

	if (res == _SUCCESS) {
		mod_timer(&pmlmepriv->scan_to_timer, jiffies +
			  msecs_to_jiffies(SCANNING_TIMEOUT));

		pmlmepriv->scan_interval = SCAN_INTERVAL;/*  30*2 sec = 60sec */
	} else
		_clr_fwstate_(pmlmepriv, _FW_UNDER_SURVEY);

	return res;
}

void rtw_getbbrfreg_cmdrsp_callback23a(struct rtw_adapter *padapter,
				       struct cmd_obj *pcmd)
{
	kfree(pcmd->parmbuf);
	kfree(pcmd);
}

int rtw_createbss_cmd23a(struct rtw_adapter  *padapter)
{
	struct cmd_obj *pcmd;
	struct cmd_priv *pcmdpriv = &padapter->cmdpriv;
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;
	struct wlan_bssid_ex *pdev_network;
	u8 res = _SUCCESS;

	pdev_network = &padapter->registrypriv.dev_network;

	if (pmlmepriv->assoc_ssid.ssid_len == 0) {
		RT_TRACE(_module_rtl871x_cmd_c_, _drv_info_,
			 "createbss for Any SSid:%s\n",
			 pmlmepriv->assoc_ssid.ssid);
	} else {
		RT_TRACE(_module_rtl871x_cmd_c_, _drv_info_,
			 "createbss for SSid:%s\n",
			 pmlmepriv->assoc_ssid.ssid);
	}

	pcmd = kzalloc(sizeof(struct cmd_obj), GFP_ATOMIC);
	if (!pcmd) {
		res = _FAIL;
		goto exit;
	}

