torvalds/linux/drivers/staging/rtl8723au/core/rtw_cmd.c
	ether_addr_copy(psetstakey_para->addr, sta->hwaddr);

	if (check_fwstate(pmlmepriv, WIFI_STATION_STATE)) {
		psetstakey_para->algorithm =
			(unsigned char)psecuritypriv->dot11PrivacyAlgrthm;
	} else {
		GET_ENCRY_ALGO(psecuritypriv, sta, psetstakey_para->algorithm,
			       false);
	}

	if (unicast_key == true) {
		memcpy(&psetstakey_para->key, &sta->dot118021x_UncstKey, 16);
	} else {
		int idx = psecuritypriv->dot118021XGrpKeyid;

		memcpy(&psetstakey_para->key,
		       &psecuritypriv->dot118021XGrpKey[idx].skey, 16);
	}

	/* jeff: set this because at least sw key is ready */
	padapter->securitypriv.busetkipkey = 1;

	res = rtw_enqueue_cmd23a(pcmdpriv, ph2c);

exit:

	return res;
}

int rtw_clearstakey_cmd23a(struct rtw_adapter *padapter, u8 *psta, u8 entry,
			   u8 enqueue)
{
	struct cmd_obj *ph2c;
	struct set_stakey_parm *psetstakey_para;
	struct cmd_priv *pcmdpriv = &padapter->cmdpriv;
	struct set_stakey_rsp *psetstakey_rsp = NULL;
	struct sta_info *sta = (struct sta_info *)psta;
	int res = _SUCCESS;

	if (!enqueue) {
		clear_cam_entry23a(padapter, entry);
	} else {
		ph2c = kzalloc(sizeof(struct cmd_obj), GFP_KERNEL);
		if (!ph2c) {
			res = _FAIL;
			goto exit;
		}

		psetstakey_para = kzalloc(sizeof(struct set_stakey_parm),
					  GFP_KERNEL);
		if (!psetstakey_para) {
			kfree(ph2c);
			res = _FAIL;
			goto exit;
		}

		psetstakey_rsp = kzalloc(sizeof(struct set_stakey_rsp),
					 GFP_KERNEL);
		if (!psetstakey_rsp) {
			kfree(ph2c);
			kfree(psetstakey_para);
			res = _FAIL;
			goto exit;
		}

		init_h2fwcmd_w_parm_no_rsp(ph2c, psetstakey_para,
					   _SetStaKey_CMD_);
		ph2c->rsp = (u8 *) psetstakey_rsp;
		ph2c->rspsz = sizeof(struct set_stakey_rsp);

		ether_addr_copy(psetstakey_para->addr, sta->hwaddr);

		psetstakey_para->algorithm = 0;

		psetstakey_para->id = entry;

		res = rtw_enqueue_cmd23a(pcmdpriv, ph2c);
	}
exit:
	return res;
}

int rtw_addbareq_cmd23a(struct rtw_adapter *padapter, u8 tid, u8 *addr)
{
	struct cmd_priv *pcmdpriv = &padapter->cmdpriv;
	struct cmd_obj *ph2c;
	struct addBaReq_parm *paddbareq_parm;
	int res = _SUCCESS;

	if (tid >= MAXTID) {
		res = _FAIL;
		goto exit;
	}

	ph2c = kzalloc(sizeof(struct cmd_obj), GFP_ATOMIC);
	if (!ph2c) {
		res = _FAIL;
		goto exit;
	}

	paddbareq_parm = kzalloc(sizeof(struct addBaReq_parm), GFP_ATOMIC);
	if (!paddbareq_parm) {
		kfree(ph2c);
		res = _FAIL;
		goto exit;
	}

	paddbareq_parm->tid = tid;
	ether_addr_copy(paddbareq_parm->addr, addr);

	init_h2fwcmd_w_parm_no_rsp(ph2c, paddbareq_parm,
				   GEN_CMD_CODE(_AddBAReq));

	res = rtw_enqueue_cmd23a(pcmdpriv, ph2c);
exit:
	return res;
}

int rtw_dynamic_chk_wk_cmd23a(struct rtw_adapter *padapter)
{
	struct cmd_obj *ph2c;
	struct drvextra_cmd_parm *pdrvextra_cmd_parm;
	struct cmd_priv *pcmdpriv = &padapter->cmdpriv;
	int res = _SUCCESS;

	ph2c = kzalloc(sizeof(struct cmd_obj), GFP_ATOMIC);
	if (!ph2c) {
		res = _FAIL;
		goto exit;
	}

	pdrvextra_cmd_parm = kzalloc(sizeof(*pdrvextra_cmd_parm), GFP_ATOMIC);
	if (!pdrvextra_cmd_parm) {
		kfree(ph2c);
		res = _FAIL;
		goto exit;
	}

	pdrvextra_cmd_parm->ec_id = DYNAMIC_CHK_WK_CID;
	pdrvextra_cmd_parm->type_size = 0;
	pdrvextra_cmd_parm->pbuf = (u8 *)padapter;

	init_h2fwcmd_w_parm_no_rsp(ph2c, pdrvextra_cmd_parm,
				   GEN_CMD_CODE(_Set_Drv_Extra));

	res = rtw_enqueue_cmd23a(pcmdpriv, ph2c);
exit:

	return res;
}

static void traffic_status_watchdog(struct rtw_adapter *padapter)
{
	u8 bEnterPS;
	u8 bBusyTraffic = false, bTxBusyTraffic = false, bRxBusyTraffic = false;
	u8 bHigherBusyTraffic = false, bHigherBusyRxTraffic = false;
	u8 bHigherBusyTxTraffic = false;
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;
	int BusyThreshold = 100;
	struct rt_link_detect *ldi = &pmlmepriv->LinkDetectInfo;

	/*  */
	/*  Determine if our traffic is busy now */
	/*  */
	if (check_fwstate(pmlmepriv, _FW_LINKED)) {
		if (rtl8723a_BT_coexist(padapter))
			BusyThreshold = 50;
		else if (ldi->bBusyTraffic)
			BusyThreshold = 75;
		/*  if we raise bBusyTraffic in last watchdog, using
		    lower threshold. */
		if (ldi->NumRxOkInPeriod > BusyThreshold ||
		    ldi->NumTxOkInPeriod > BusyThreshold) {
			bBusyTraffic = true;

			if (ldi->NumRxOkInPeriod > ldi->NumTxOkInPeriod)
				bRxBusyTraffic = true;
			else
				bTxBusyTraffic = true;
		}

		/*  Higher Tx/Rx data. */
		if (ldi->NumRxOkInPeriod > 4000 ||
		    ldi->NumTxOkInPeriod > 4000) {
			bHigherBusyTraffic = true;

			if (ldi->NumRxOkInPeriod > ldi->NumTxOkInPeriod)
				bHigherBusyRxTraffic = true;
			else
				bHigherBusyTxTraffic = true;
		}

		if (!rtl8723a_BT_coexist(padapter) ||
		    !rtl8723a_BT_using_antenna_1(padapter)) {
		/*  check traffic for  powersaving. */
			if (((ldi->NumRxUnicastOkInPeriod +
			      ldi->NumTxOkInPeriod) > 8) ||
			    ldi->NumRxUnicastOkInPeriod > 2)
				bEnterPS = false;
			else
				bEnterPS = true;

			/*  LeisurePS only work in infra mode. */
			if (bEnterPS)
				LPS_Enter23a(padapter);
			else
				LPS_Leave23a(padapter);
		}
	} else
		LPS_Leave23a(padapter);

	ldi->NumRxOkInPeriod = 0;
	ldi->NumTxOkInPeriod = 0;
	ldi->NumRxUnicastOkInPeriod = 0;
	ldi->bBusyTraffic = bBusyTraffic;
	ldi->bTxBusyTraffic = bTxBusyTraffic;
	ldi->bRxBusyTraffic = bRxBusyTraffic;
	ldi->bHigherBusyTraffic = bHigherBusyTraffic;
	ldi->bHigherBusyRxTraffic = bHigherBusyRxTraffic;
	ldi->bHigherBusyTxTraffic = bHigherBusyTxTraffic;
}

static void dynamic_chk_wk_hdl(struct rtw_adapter *padapter, u8 *pbuf, int sz)
{
	struct mlme_priv *pmlmepriv;

	padapter = (struct rtw_adapter *)pbuf;
	pmlmepriv = &padapter->mlmepriv;

#ifdef CONFIG_8723AU_AP_MODE
	if (check_fwstate(pmlmepriv, WIFI_AP_STATE))
		expire_timeout_chk23a(padapter);
#endif

	rtl8723a_sreset_xmit_status_check(padapter);

	linked_status_chk23a(padapter);
	traffic_status_watchdog(padapter);

	rtl8723a_HalDmWatchDog(padapter);

	/*  */
	/*  BT-Coexist */
	/*  */
	rtl8723a_BT_do_coexist(padapter);
}

static void lps_ctrl_wk_hdl(struct rtw_adapter *padapter, u8 lps_ctrl_type)
{
	struct pwrctrl_priv *pwrpriv = &padapter->pwrctrlpriv;
	struct mlme_priv *pmlmepriv = &padapter->mlmepriv;
	u8 mstatus;

	if (check_fwstate(pmlmepriv, WIFI_ADHOC_MASTER_STATE) ||
	    check_fwstate(pmlmepriv, WIFI_ADHOC_STATE))
		return;

	switch (lps_ctrl_type) {
	case LPS_CTRL_SCAN:
		rtl8723a_BT_wifiscan_notify(padapter, true);
		if (!rtl8723a_BT_using_antenna_1(padapter)) {
			if (check_fwstate(pmlmepriv, _FW_LINKED))
				LPS_Leave23a(padapter);
			}
		break;
	case LPS_CTRL_JOINBSS:
		LPS_Leave23a(padapter);
		break;
	case LPS_CTRL_CONNECT:
		mstatus = 1;/* connect */
		/*  Reset LPS Setting */
		padapter->pwrctrlpriv.LpsIdleCount = 0;
		rtl8723a_set_FwJoinBssReport_cmd(padapter, 1);
		rtl8723a_BT_mediastatus_notify(padapter, mstatus);
		break;
	case LPS_CTRL_DISCONNECT:
		mstatus = 0;/* disconnect */
		rtl8723a_BT_mediastatus_notify(padapter, mstatus);
		if (!rtl8723a_BT_using_antenna_1(padapter))
			LPS_Leave23a(padapter);
		rtl8723a_set_FwJoinBssReport_cmd(padapter, 0);
		break;
	case LPS_CTRL_SPECIAL_PACKET:
		pwrpriv->DelayLPSLastTimeStamp = jiffies;
		rtl8723a_BT_specialpacket_notify(padapter);
		if (!rtl8723a_BT_using_antenna_1(padapter))
			LPS_Leave23a(padapter);
		break;
	case LPS_CTRL_LEAVE:
		rtl8723a_BT_lps_leave(padapter);
		if (!rtl8723a_BT_using_antenna_1(padapter))
			LPS_Leave23a(padapter);
		break;

	default:
		break;
	}
}

